sdaiDeleteNPL(Sdai_Id_aggr*)
\details
Deletes an instance of the Non-Persistent List.
\param list [in] An identifier of the Non-Persistent List to be deleted.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance inst768 = ...;
SdaiNPL npl = sdaiCreateNPL();
SdaiBoolean validationResult = sdaiValidateInverseAttrs(inst768, npl);
...
sdaiDeleteNPL(npl);